## Terraform Plan Output for test
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aks.azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + cost_analysis_enabled               = true
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "test-aks"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "canadacentral"
      + name                                = "test-aks"
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "cst8918-final-project-group-2"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Standard"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "environment" = "test"
        }
      + workload_identity_enabled           = false

      + default_node_pool {
          + auto_scaling_enabled = false
          + kubelet_disk_type    = (known after apply)
          + max_count            = 1
          + max_pods             = (known after apply)
          + min_count            = 1
          + name                 = "masterpool"
          + node_count           = 1
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_B2s"
          + vnet_subnet_id       = "/subscriptions/431fca8d-e614-4268-aa3c-22a2e684933a/resourceGroups/cst8918-final-project-group-2/providers/Microsoft.Network/virtualNetworks/cst8918-final-project-vnet/subnets/cst8918-final-project-test-subnet"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_data_plane = "azure"
          + network_mode       = (known after apply)
          + network_plugin     = "kubenet"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = (known after apply)
          + service_cidrs      = (known after apply)
        }
    }

  # module.redis.azurerm_redis_cache.main_cache will be created
  + resource "azurerm_redis_cache" "main_cache" {
      + access_keys_authentication_enabled = true
      + capacity                           = 1
      + family                             = "C"
      + hostname                           = (known after apply)
      + id                                 = (known after apply)
      + location                           = "canadacentral"
      + minimum_tls_version                = "1.2"
      + name                               = "test-redis"
      + non_ssl_port_enabled               = false
      + port                               = (known after apply)
      + primary_access_key                 = (sensitive value)
      + primary_connection_string          = (sensitive value)
      + private_static_ip_address          = (known after apply)
      + public_network_access_enabled      = true
      + redis_version                      = "6"
      + replicas_per_master                = (known after apply)
      + replicas_per_primary               = (known after apply)
      + resource_group_name                = "cst8918-final-project-group-2"
      + secondary_access_key               = (sensitive value)
      + secondary_connection_string        = (sensitive value)
      + sku_name                           = "Basic"
      + ssl_port                           = (known after apply)
      + tags                               = {
          + "environment" = "test"
        }
    }

  # module.weather_app.kubernetes_config_map.weather_app_config will be created
  + resource "kubernetes_config_map" "weather_app_config" {
      + data = (known after apply)
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "weather-app-config"
          + namespace        = "weather-app"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.weather_app.kubernetes_deployment.weather_app will be created
  + resource "kubernetes_deployment" "weather_app" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + name             = "weather-app"
          + namespace        = "weather-app"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "1"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "app" = "weather-app"
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "app" = "weather-app"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + scheduler_name                   = (known after apply)
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + image                      = "cst8918finalprojectacr.azurecr.io/weather-app:latest"
                      + image_pull_policy          = (known after apply)
                      + name                       = "weather-app"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + env {
                          + name = "WEATHER_API_KEY"

                          + value_from {
                              + secret_key_ref {
                                  + key  = "WEATHER_API_KEY"
                                  + name = "weather-api-secret"
                                }
                            }
                        }

                      + env_from {
                          + config_map_ref {
                              + name = "weather-app-config"
                            }
                        }

                      + liveness_probe {
                          + failure_threshold     = 3
                          + initial_delay_seconds = 30
                          + period_seconds        = 10
                          + success_threshold     = 1
                          + timeout_seconds       = 1

                          + http_get {
                              + path   = "/health"
                              + port   = "3000"
                              + scheme = "HTTP"
                            }
                        }

                      + port {
                          + container_port = 3000
                          + protocol       = "TCP"
                        }

                      + readiness_probe {
                          + failure_threshold     = 3
                          + initial_delay_seconds = 5
                          + period_seconds        = 5
                          + success_threshold     = 1
                          + timeout_seconds       = 1

                          + http_get {
                              + path   = "/health"
                              + port   = "3000"
                              + scheme = "HTTP"
                            }
                        }

                      + resources {
                          + limits   = {
                              + "cpu"    = "500m"
                              + "memory" = "512Mi"
                            }
                          + requests = {
                              + "cpu"    = "250m"
                              + "memory" = "256Mi"
                            }
                        }
                    }
                }
            }
        }
    }

  # module.weather_app.kubernetes_namespace.weather_app will be created
  + resource "kubernetes_namespace" "weather_app" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "weather-app"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.weather_app.kubernetes_secret.redis_secret will be created
  + resource "kubernetes_secret" "redis_secret" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "redis-secret"
          + namespace        = "weather-app"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.weather_app.kubernetes_secret.weather_api_key_secret will be created
  + resource "kubernetes_secret" "weather_api_key_secret" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "weather-api-secret"
          + namespace        = "weather-app"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.weather_app.kubernetes_service.weather_app will be created
  + resource "kubernetes_service" "weather_app" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + name             = "weather-app-service"
          + namespace        = "weather-app"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + selector                          = {
              + "app" = "weather-app"
            }
          + session_affinity                  = "None"
          + type                              = "LoadBalancer"

          + port {
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = "3000"
            }
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```
</details>